{"index":{"title":"index","links":[],"tags":[],"content":""},"가스센서/가스센서에대하여/1.-가스-센서란":{"title":"1. 가스 센서란","links":["tags/GasSensor","tags/History","가스센서/가스센서에대하여/첨부파일/RKI_Gas_Detection_History.pdf"],"tags":["GasSensor","History"],"content":"#GasSensor#History\n리켄케이키 히스토리\nhttps://www.academia.edu/28806739/Gas_Detection_History\nRKI_Gas_Detection_History.pdf\nhttps://slideplayer.com/slide/5305869/\n** Table of Cpntents**\n과거 광부들은 유해가스로부터 생명을 지키기 위해 탄광에 들어갈 때마다 카나리아라는 새를 데리고 들어갔습니다. 카나리아는 메탄, 일산화탄소 가스에 매우 민감해 유해가스에 소량만 노출돼도 죽습니다. 광부들은 카나리아의 노래가 들리면 안심하고 채굴했고 카나리아가 노래를 부르지 않을 땐 탄광에서 뛰쳐나와 스스로 생명을 지킬 수 있었습니다.\n출처 : 이웃집과학자(http://www.astronomer.rocks)\n가스센서 §\n가스센서(gas sensor)는 가스를 검출하는 센서의 총칭이다. 각종 가스가 에너지원으로 이용되기 시작하면서 공업 분야는 물론, 가정용으로서도 요구가 높아진 센서의 하나이다. 가스의 성분을 측정한 후 그 결과에 따라 장치를 제어하거나 경보를 발신하기 위해서는 기체 속에 포함되어 있는 특정 가스 성분량에 의해 신호를 발신하는 가스 센서가 사용된다.1\n개요 §\n가스센서는 화학센서의 일종으로서 인간이 갖고 있는 5감 중 후각의 불완전성을 보완하고 그 기능을 확장시키는 고성능 인조감각기관의 하나이다. 지상에 존재하거나 인간에 의해 개발된 무수한 센서들 중 가스센서가 기본이 되는 이유는 이는 모든 생명체를 유지하는데 필수 불가결의 요소인 공기를 대상으로 하기 때문이라 생각된다. 지금까지 가스센서의 계속적인 개발에 의해 보다 낮은 가격으로 보다 높은 성능의 소자와 시스템의 획득이 가능하게 되었다.\n그러나 오늘날의 고성능 가스 검출장치의 원형이 출현한 역사는 비교적 짧은 편으로 예를 들면 반도체가스 센서의 경우 1972년 일본의 N. Taguchi에] 의해 각종 가연성가스에 대해 광범위하게 감지효과를 갖는 센서가 처음으로 실용화되었다. 이는 SnO₂를 주물질로 한 벌크형소자로 그 이후에 개발된 많은 가스센서의 본보기가 되고 있다. 표 1은 가스센서 개발연구의 주요사항을 간추린 것이다. 표 1에 나타낸 년도별 주요개발내용은 여러 가지 타입의 가스센서 중 반도체 가스센서에 관한 것이다. 이 표에서 보는 바와 같이 반도체가스센서는 그 형태로 볼 때 벌크형→후막형→박막형→마이크로형으로 점차 소형화 되어가고 있음을 알 수 있으며 최근에는 이들 센서를 여러 개 조합한 센서어레이에 대한 연구가 활발히 진행되고 있다.\n표1. 가스센서의 개발 및 연구.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n년연구자연구개발내용1934H. S. Taylor수소와 ZnO의 화학흡착1940D. A. Dowden 등접촉반응과 전자밀도1957K. Kiukkola 등지르코니아 산소센서1959S. J. Elovich고체표면흡착율1960S. R. MorrisonSnO₂흡착과 표면장벽 효과1965J. E. Houston 등SnO₂에서의 흡착현상1971Mizokawa, NakamuraSnO₂에서의 산·수소흡착1972N. Taguchi가연성가스센서개발1973Sato and TanabeSnO₂투명도전막 생성1975LundstromMOS형 수소가스센서1977K. N. U.기체흡수효과반도체1978Nitta and Haradome프로판가스 감지소자1978Nitta 등후막형 CO가스센서1980G. N. Advani and A. G. JordanSnO₂박막가스센서1984K. Dobos and ZimmerMOSFET형 가스감지소자1986A. Grisel and DemarneA. Grisel and Demarne\n가스센서 기술 §\n표 2. 가스 검지 방법\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n대분류중분류대상가스전기화학적 방법용액도전방식정전위전해방식NOx, CO, SOx, H₂S격막갈바니방식전량법SOx, H₂S광학적 방법적외선흡수법NOx, CO, CO₂, H₂S광간섭법NOx, H₂S, O₂화학발광법NOx, CO, CO₂, SOx시험지광전도법O₂, O₃전기적 방법수소염이온화법열전도법CO, CO₂접촉연소법CO, CH반도체법CO, H₂S, H₂\n가스를 검지하는 방법에는 표 2와 같이 여러가지 방법이 있으나 이 중 현재 많이 이용되는 방법으로는 정전위전해방식, 적외선 흡수법, 접촉연소법, 반도체법 등이 있다.\n적외선 흡수법 §\n실내외 환경 측정 특히 배기가스를 측정하는 방법 중 적외선 흡수법은 가스에 대한 선택성과 신뢰성이 높다는 점에서 관심을 모으고 있다. 적외선 흡수법에는 분산방식과 비분산방식이 있는데 분산 방식이 구조가 간단하고 사용이 간편하다.\n기체분자들은 각기 진동에너지 양자에 해당하는 에너지만을 선택적으로 흡수하는 성질이 있는데 대체로 적외선 영역의 빛을 진동에너지로 흡수한다. 이와 같은 이유로 CO₂, CO, CH₄, C₃H₈ 등은 각각 독특한 적외선에 대한 흡수스펙트럼을 갖는데 예를 들면 CO₂는 4.25 Ռm, CO는 4.7 Ռm, CH4는 3.3 Ռm의 파장을 흡수한다. 빛을 흡수하는 정도는 농도에 따라 달라진다.\n이때 어떤 파장에서 흡광도 A(λ)는 다음의 Beer-Lambert식에 의해 정해진다.\nA(λ) = E(λ)bC\n(λ) = -log[L(λ)L₀(λ)]\n\n\n\n\n\n\n여기서 E(λ)는 흡광계수, b는 투과거리, C는 가스농도, I(λ)는 측정광의 세기, I0(λ)는 기준광의 세기를 각각 나타낸다. 이 식에서 알 수 있는 바와 같이 흡수도는 적외선을 통과시키는 셀의 길이와 농도에 비례하므로 흡수계수 E(λ)가 충분히 큰 단색광을 측정가스에 통과시켜 투과된 빛의 세기를 측정함으로써 다른 가스의 간섭이 없이 측정대상 가스만의 농도를 알 수가 있다. 비분산방식에서 단색광을 얻기 위해 방출된 넓은 파장범위의 적외선을 광학필터나 가스흡광형필터로 단색화시키는 방법을 이용한다. 그림 1은 각종 적외선 검출기의 스펙트럼응답특성을 사용 상한온도와 함께 나타낸 것이다. 이 그림에서 4∼5 Ռm 영역에서 탐지도(D*)가 높고 센서재료로서 InSb, PbSe, HgCdTe 등이 있으나 77 K 또는 196 K 정도의 낮은 온도에서 나타나는 특성이므로 이를 CO₂계측기에 이용하기에는 불편한 점이 있다. 그리고 HC 가스의 응용범위인 3∼4 Ռm에서 탐지도가 높은 재료란 InAs나 PbS 또는 PbSe 등이 있으나 이 경우 역시 낮은 온도구비조건을 만족해야 한다. 현재 비분산적외선법으로 CO₂, CO 또는 HC가스 등의 농도계측기용 적외선센서로서 탐지도는 낮으나 광범위한 적외선 파장영역을 감지하고 실온에서 사용가능한 단색광형성필터를 결합한 것을 이용하는 것이 가장 경제적인 것으로 알려져 있다. 다만 온도의존성을 회로적으로 보상해야 한다. 그림 2는 비분산 적외선식을 이용한 가스계측기의 하드웨어블록도이다. 이와 같은 구조의 계측기로서 CO₂, CO 또는 HC 가스의 농도를 측정함에 있어서 가스농도에 대한 출력전압이 1차비례관계를 가질 때 그 구조는 보다 간단해진다. Beer-Lambert의 법칙에 의하면 광의 흡수도는 가스농도와 광의 통과길이에 비례함을 알 수 있는데 흡수도를 높이기 위해 그 길이를 증가시켜야 한다. 그러나 이 경우 장치가 길어지게 되므로 간단한 실내환경측정용으로는 20 cm 정도의 길이로서 충분하다.\n반도체법 §\n\n\n반도체를 이용한 가스검지의 기본원리는 공기성분과 반도체표면의 화학적인 상호작용에 의해 그 표면의 전도전자의 밀도변화를 이용하는 것이다. 이와 같은 화학작용은 다음과 같은 4가지 단계로 이루어진다.\n(1) 반도체 표면에 산소의 사전흡착 (preadsorption)\n(2) 특정가스의 흡착\n(3) 흡착가스와 산소의 반응\n(4) 반응가스의 탈착\n위의 4단계 중 세번째 단계에서 전자를 주고 받는 과정을 포함하며 이것이 센서의 감지효과로 나타나는 것이다. 센서가 가스에 대한 감지효과를 나타낼 때 그 전기전도도에 변화를 일으키게 되고 전기전도도는 흡착되는 공기입자가 억셉터로서 작용할 때 감소하고 도너로서 작용할 경우에는 증가한다. 즉 억셉터 흡착의 경우 전기전도도 변화 △σ는 다음 식으로 표시된다.\n△σ = -2qμnNDLD(α - ξSD)\n△σ = 2qqμnNDLD(ξSD - θ)\n여기서 q는 캐리어의 전하, μn은 전자의 이동도, ND는 피흡착체의 다수캐리어 농도, LD는 Debye 길이, ξSD는 사전흡착의 경우 나타나는 밴드의 구부러짐, α는 (Eta-χ-δ)/KT (Eta: 흡착억셉터의 전자친화력의 값, χ: 진공준위, δ: Ec-Ef, K: Boltzman 상수, T: 절대온도)로 표시되는 양, 그리고 θ는 (Itd-χ-δ)/KT(Itd: 도너의 이온화 퍼텐셜)로 표시되는 양이다. 이들 식에서 보는 바와 같이 전기전도도는 다수캐리어 이동도, Debye 길이 및 캐리어농도에 주로 의존한다. 실제에 있어서 반도체가스센서의 전기전도도는 흡착가스종의 농도에 의존하고 그 의존성의 경향은 가스의 종류에 따라 달라진다. 기본적으로 피흡착체의 평형상태 전기전도도σ는 그 주위에 있는 산소압 PO2와 다음의 관계를 가진다.\nσ≅ Po₁⁻m\n여기서 m은 보통 0∼0.5 사이의 값을 가지며 이는 센서표면의 기공률과 표면미세구조 등에 의존한다. 현재 반도체센서재료로서 많이 사용되고 있는 ZnO, TiO₂ 및 SnO₂ 등에 있어서 m의 값은 대략 0.5임이 알려져 있고 이와 같은 금속산화물에 산소가 흡착될 때 그 표면온도에 따라 O₂⁻, O⁻ 또는 O⁣⁣ 등의 다른 이온상태를 가지게 된다. 이와 같은 산소는 사전흡착에 의해 항상 금속반도체 표면에 존재하고 CO나 CH계 가스 등이 흡착될 경우 산화반응을 일으켜 이들 가스의 탈착에 큰 기여를 한다. 예를 들면 CO가스가 사전흡착된 산소와 반응하여 CO₂가스로 탈착되는 과정을 다음과 같이 나타낼 수 있다.\nCO + 0₂⁻ → CO₂↑ + e⁻\n그리고 도시가스의 주성분인 CH₄ 가스의 경우에도 표면 또는 격자 중의 산소와 다음의 반응을 나타내는 것으로 생각되고 있다.\nCH₄+ 2O → CH₃- O + H - O\nCH₃- O + 3O → O - CH - O + 2H - O\nO - CH - O + O → CO₂↑ + H - O + 2V₀\n동시에\nCH₃- O + CH₃- O →H₂O + C₂H₄+ O + V₀\n여기서 Vo는 산소의 탈착으로 인한 빈자리를 나타낸다. 산소의 경우에 대한 식인 (5)를 CO가스에 대해 나타내면\nσ= σ₀ + αPco m\n으로 되는데 여기서 α는 σ와 PCO 관계 그래프에서 직선의 기울기이고 m은 보통 약 1/2이 된다.\n반도체 가스센서의 감도(Sensitivity)는 소자의 저항변화율로 표시하는데 이에 못지 않게 중요한 인자로는 선택성(Selectivity), 안정도(Stability) 및 속도(Speed)가 있는데 이를 4S조건이라 한다. 이와 같은 구비조건을 완벽하게 모두 갖추고 있는 소자는 그리 많지 않으나 재료, 구조, 동작조건을 조절함으로써 상당히 향상된 특성을 얻고 있다. 그림 4는 대표적인 모물질인 SnO₂ 가스센서의 특성의 예를 보인 것이다. 이 그림에서 보는 바와 같이 SnO₂/Ca-Pt 센서는 부탄에 대해 상대적으로 높은 감도를 가지므로 이 경우 이 센서는 부탄감지용 센서로서의 기능을 다할 수가 있다. 그림 4의 결과는 동작온도를 350 ℃로 하였을 경우의 것으로 같은 재료의 소자라 할지라도 동작조건을 달리하면 감도특성이 달라지게 된다.\n위에서 말한 반도체식 가스센서의 원리에 기초하여 여러가지 형태의 가스센서가 개발되고 있다. 이를 형태별로 분류해 보면 벌크형, 후막형, 박막형, MOS형 및 마이크로형 등이 있다. 최근 소자의 소형화·규격화에 대한 관심이 높아져 박막형과 마이크로형에 대한 개발연구가 활발히 진행되고 있다. 그림 5는 마이크로 가스센서의 단면도를 나타낸 것이다.\n접촉연소법 §\n\n\n접촉연소법에 의한 가스센서는 비분산적외선법 및 반도체법과 더불어 현재 가장 많이 사용되고 있는 소자이다. 접촉연소식 가스센서는 1923년경 미국의 J &amp; W사가 모델 F를 내놓은 것이 실용화의 효시이며 그후 1958년 일본의 광명이화학공업에서 모델FM-1을 출시하여 이들이 오늘날 접촉연소식소자의 본보기가 되었다. 초기의 접촉연소식소자는 백금코일만으로 되어있어 장기안정성이 좋지 않았으나 1962년 Baker는 백금코일을 내화성의 산화물인 알루미나 담체와 함께 사용한 소자를 개발함으로써 안정성과 감도를 향상시켰다. 그 이후 CH₄, C₃H₈ 및 C₄H₁₀ 등 탄화수소계 가스모니터링에 대한 수요가 높아짐에 따라 이에 대한 개발연구가 매우 활발히 이루어져 현재감도와 안정도 면에서 많은 향상을 보이고 있다.\n접촉연소식소자의 동작원리는 반도체식에 비해 단순하며 이는 백금선의 온도에 대한 저항변화를 이용하는 것으로 그 위에 형성하는 비드형 담체는 같은 온도에서 연소효과를 보다 높이고 백금코일의 수명을 연장시키는 구실을 한다.\n그림 6에 비드형 접촉연소식소자의 외형을 나타내었으며 그림 7에서 보는 바와 같이 접촉연소식센서의 출력전압이 탄화수소계가스에 농도에 대해 매우 좋은 직선성을 보이고 있으며 알루미나 담지체에 적용하는 촉매의 종류에 따라 높은 선택성을 부여할 수가 있어 최근 이 형태의 가스센서에 대한 관심이 급격히 높아지고 있다. 접촉연소식센서의 출력을 얻을 때에는 가스에 대한 감지도가 거의 무시되는 기준소자와 촉매가 도입된 감지소자를 다른 두개의 저항과 연결하여 브릿지 회로를 만들고 이 회로에 가스를 주입할 때 생기는 전압변화를 읽는다.\n접촉연소식 가스센서를 이와 같이 탄화수소계가스에 대해 매우 유용한 소자이며 그 상품성 때문에 국내에서도 경쟁적인 개발이 이루어지고 있다. 최근에는 보다 소형화·규격화를 위해 후막형이나 박막형으로 소자를 제조하려는 시도가 이루어지고 있으나 아직 개발단계에 있다.\n차량용 가스센서 §\n차량용 가스센서는 자동차 등에서 배출하는 가스를 측정하는 센서이다. 차량의 대수가 늘어남에 따라 차량에 의한 대기오염 문제 또한 주요한 문제로 대두되고 있다. 차량은 다양한 배기가스를 배출하고 있으며, 이 중에서 특히 이산화탄소와 이산화질소는 인체에 매우 유해한 가스로 알려져 있다. 이 때문에, 이러한 유독가스인 이산화탄소와 이산화질소를 차량에서 바로 감지하고 이를 제어하려는 요구가 급속히 높아지고 있다. 이를 위해서는, 차량의 가스를 직접 감지하기 위한 가스센서의 개발이 필수적이다. 또한 차량 실내 환경을 쾌적화하기 위한 자동 환기 센서로 활용되고 있다. 일반적으로 가스센서는 반도체식, 고체전해질식, 접촉연소식 등이 사용되고 있으며, 이 중에서 반도체식은 센서 제작이 용이하고, 다양한 범위의 가스검출이 가능하여 많이 연구되고 있는 센서이다.\n차량용 가스 농도 센서는 산소 농도를 검출 하는 장치로, 산소농도와 미연가스농도로부터 연소공연비를 최적의 상태로 제어하는 A/F 센서나 전자제어식 연료분사장치에서 배기가스 중 산소농도를 검출하는 O₂ 센서 등이 있다.\n활용 §\n\n\n대기오염 : VOC 센서. VOC(Volatile Organic Compounds, 휘발성유기화합물)는 탄소기반 화학물질로 주변에서 흔히 볼 수 있는 도료 희석제, 네일 리무버나 각종 연료에 포함되어 있으며, 상온에서 쉽게 증발하는 특징을 가진다. 일부 VOC는 인체에 해로울 뿐만 아니라 환경에도 큰 피해를 줄 수 있어, 실내외에서의 공기질 모니터링에 대한 필요성이 증가하고 있다.\n\n\n지하철, 지하상점, 주차장 등 실내와 실외에 존재하는 다종의 공기 오염원을 동시에 감지 및 모니터링\n\n\n가스량 경보, 환경가스 감지 등\n\n\n냉장고 : 냉장고 내부 제균 및 탈취\n\n\n자동차 : 배기가스 규제, 유해가스 차단 등, 차량 실내 자동 환기 (AQS)\n\n\n의료 : 인체호흡으로 발생되는 가스들을 분석. 당뇨·간질환·폐암 등의 질병 감지\n\n\n공기청정기\n\n\nCO 가스 경보기\n\n\n음주측정기 : 호흡을 통한 음주 측정\n\n\n자동환기팬\n\n\n식품 : 휘발성유기화합물(VOC: Volatile Organic Compounds)의 양을 감지하여 식품의 신선도 및 부패여부를 조기에 검출. 식중독 예방, 과일 숙성도 체크 등\n\n\n군사 및 안전방재 : 재해 및 테러 시 발생하는 일산화탄소 등 생화화적 유독가스를 분석\n\n\n참조 §\nFootnotes §\n\n\n해시넷-가스센서 http://wiki.hash.kr/index.php/%EA%B0%80%EC%8A%A4%EC%84%BC%EC%84%9C ↩\n\n\n"},"가스센서/가스센서에대하여/가스-센서-수명-이해":{"title":"가스 센서 수명 이해","links":["tags/가스센서수명","tags/전기화학식"],"tags":["가스센서수명","전기화학식"],"content":"#가스센서수명#전기화학식\n출처: HazardEx - 가스 센서 수명 이해 (hazardexonthenet.net)\n가스 센서 수명 이해 §\n2016년 11월 29일\n이 기사에서는 Crowcon의 가스 검지 전문가 Andy Avenell이 전기 화학 및 펠리스터 독성 및 산소 가스 센서의 작동 수명에 영향을 미치는 요인에 대해 간략하게 설명합니다. 이러한 센서의 작동 방식, 정상적인 기대 수명에 대한 설명과 작동 수명을 단축시킬 수 있는 요인에 대한 검토가 제공됩니다. 센서 수명을 예측하고 교체 계획을 세우는 데 도움이 되는 제안도 제공됩니다.\n\n소개 §\n가스 감지기는 위험한 가스 및 그 영향으로부터 인력과 장비를 보호하기 위해 산업에서 광범위하게 사용됩니다. 휴대용 및 고정 소수점 가스 검지기 사용자는 작동 수명 동안 기기를 안전하게 작동하는 데 드는 잠재적으로 상당한 비용에 대해 잘 알고 있을 것입니다.\n1부: 전기 화학 센서 §\n작동 방식 §\n이 소형 셀에는 수성 또는 겔 전해질(종종 황산: H2SO4)로 적신 전극이 포함되어 있습니다. 작업 전극은 촉매로 처리되어 대상 가스 (예 : 일산화탄소 : CO, 황화수소 : H2S 등)가 산화되거나 환원됨에 따라 작은 전류를 생성합니다. 센서는 필요한 스케일의 가스 농도를 표시하도록 설정된 증폭기에 연결됩니다.\n전기 화학 센서는 주변 환경의 가스가 셀 표면의 구멍을 통해 들어가는 확산 모드에서 가장 자주 사용됩니다 (가스의 자연 이동성에 의해 구동됨). 일부 기기는 펌프를 통해 공기/가스 샘플을 센서에 공급합니다. PTFE 멤브레인은 물이나 오일이 셀에 들어가는 것을 방지하기 위해 구멍 위에 장착됩니다. 센서 범위와 감도는 다양한 크기의 구멍을 사용하여 설계에 따라 달라질 수 있습니다. 구멍이 클수록 감도와 분해능이 높아지는 반면, 작은 구멍은 감도와 분해능을 감소시키지만 범위는 늘어납니다.\n갈바닉 산소 센서는 전기 화학 산소 센서에 대해 설명 된 것과 유사한 원리를 사용하여 작동하지만 수명은 예측 가능하며 교체 기간은 미리 정의되어 있습니다 (일반적으로 2 년 또는 3 년). 대부분의 독성 가스 센서와 달리 산소 센서는 대상 가스에 지속적으로 노출됩니다. 정상적인 산소 고갈 모니터링 애플리케이션에서 센서는 20.9% 부피의 산소에 노출되며, 이는 반응에 의해 점차적으로 소비되는 납 양극에서 갈바닉 반응을 일으킵니다. 따라서 산소에 반응하여 전류를 계속 생성하는 센서의 능력은 전해질에 사용할 수 있는 납 함량에 의해 제한됩니다.\n가스 검지 기기 제조업체는 센서 성능에 온도 보상이라는 중요한 구성 요소를 추가합니다. 가스에 대한 민감도(및 제로 베이스라인 신호)는 종종 온도에 따라 변하므로 주변 온도가 변함에 따라 비선형 가스 응답이 발생합니다.\n\n그림. 전기화학식 가스 센서\n가스 감지기를 개발하는 동안 센서 최소값과 최대 (일반적으로 -30 ° C에서 + 50 ° C) 사이의 온도 증분으로 동일한 유형의 여러 센서에 여러 가스 농도를 적용하여 많은 시간이 걸립니다. 수집된 데이터는 평균을 구하여 가스 감지기에 사용되는 온도 보상 알고리즘을 생성하여 센서 판독값이 전체 작동 범위에서 일관되도록 합니다.\n센서 수명에 영향을 미치는 요인 §\n극한 온도는 센서 수명에 영향을 줄 수 있습니다. 제조업체는 기기의 작동 온도 범위(일반적으로 -30°C에서 +50°C)를 명시합니다. 그러나 고품질 센서는 이러한 한계를 넘어 일시적인 일탈을 견딜 수 있습니다. H2S 또는 CO 센서(예: 60-65°C)에 대한 단기간(1-2시간) 노출은 허용되지만 반복적인 사고로 인해 전해질이 증발하고 기준선(영) 판독값이 이동하고 응답이 느려질 수 있습니다.\n감도는 저온에서 손실됩니다. 센서는 -40°C까지 작동할 수 있지만 가스에 대한 민감도가 훨씬 낮아지고(감도가 최대 80%까지 감소할 수 있음) 응답하는 데 훨씬 더 오래 걸립니다. 전해질이 -35°C 이하로 얼 위험도 있습니다.\n매우 높은 가스 농도에 노출되면 센서 성능이 저하될 수도 있습니다.\n전기화학 센서는 일반적으로 설계 한계의 최대 10배에 노출되어 테스트됩니다. 고품질 촉매 재료를 사용하여 구성된 센서는 화학적 변화나 장기적인 성능 손실 없이 이러한 노출을 견딜 수 있어야 합니다. 촉매 로딩이 낮은 센서는 손상을 입을 수 있습니다.\n센서 수명에 가장 큰 영향을 미치는 것은 습도입니다. 전기화학 센서의 이상적인 환경 조건은 섭씨 20°C 및 60%RH(상대 습도)입니다. 주변 습도가 60%RH 이상으로 증가하면 물이 전해질에 흡수되어 희석됩니다. 극단적인 경우 액체 함량이 2-3배 증가하여 잠재적으로 센서 본체에서 누출된 다음 핀을 통해 누출될 수 있습니다. 60%RH 미만에서는 전해질의 물이 탈수되기 시작합니다. 반응 시간은 전해질이 탈수됨에 따라 상당히 연장될 수 있다.\n전해질의 흡수 또는 희석을 테스트하는 빠르고 간단한 방법은 센서의 무게를 측정하는 것입니다. 원래 무게의 +/- 250mg의 변화는 누출 또는 성능 변화가 가능함을 나타냅니다. 전해질 희석 및 증발은 센서가 반대 극단의 습도 수준에 노출되는 경우 되돌릴 수 있습니다. 센서는 5-25일 이내에 원래 무게와 전해질 농도로 돌아갈 수 있으며 성능이 복원됩니다.\n센서 감도는 주변 환경에 맞게 조정될 수 있습니다: 응답이 낮거나 응답 시간이 길어지는 센서는 주변 습도가 변함에 따라 개선될 수 있으며, 이는 계절 변화가 큰 국가에서는 시기에 따라 달라질 수도 있습니다. 특히 황화수소 센서 성능은 주변 조건에 따라 달라집니다. 고정 소수점 검출기에서 센서의 감도와 응답 시간은 시운전 후 처음 2-3주 동안 현지 온도 및 습도에 따라 안정화되므로 변경될 수 있습니다. 이 효과는 설치 전에 센서가 매우 건조한 환경(예: 에어컨이 설치된 사무실)에 보관된 경우 특히 널리 퍼집니다.\n센서 전극은 비정상적인 조건에서 촉매에 흡착되거나 촉매와 반응하여 촉매를 억제하는 부산물을 생성하는 간섭 가스에 의해 중독될 수 있습니다.\n\n   그림: 전기화학 센서의 일반적인 구성\n극심한 진동과 기계적 충격은 백금 전극을 결합하는 용접부를 파쇄하고 스트립(또는 일부 센서의 와이어)과 핀을 함께 연결하여 센서를 손상시킬 수도 있습니다. 그러나 이것은 잘 구성된 센서의 경우 드문 경우입니다.\n정상적인 기대 수명 §\n일산화탄소 또는 황화수소와 같은 일반적인 가스용 전기화학 센서의 작동 수명은 일반적으로 2-3년입니다. 불화 수소와 같은 더 이국적인 가스 센서는 수명이 12-18 개월에 불과할 수 있습니다.\n이상적인 조건, 20°C 및 60%RH 영역의 안정적인 온도 및 습도에서 오염 물질 발생 없이 전기화학 센서는 11년 이상 작동하는 것으로 알려져 있습니다! 목표 가스에 주기적으로 노출되어도 이러한 소형 연료 전지의 수명이 제한되는 것은 아닙니다: 고품질 센서에는 반응에 의해 고갈되지 않는 많은 양의 촉매 물질과 견고한 도체가 있습니다.\n인용된 센서 ‘보관 수명’ 또는 ‘보관 수명’은 사용자, 서비스 회사 및 제조업체 모두에게 혼란과 좌절을 초래할 수 있습니다. 전기화학 센서의 보관 수명은 일반적으로 제조 후 6개월입니다(20°C의 이상적인 조건에서 보관하는 경우). 이 기간이 지나면 출력 신호가 드리프트되기 시작할 수 있습니다. 필연적으로이 기간의 작은 부분은 기기 또는 센서 모듈의 제조 및 고객에게 배송하는 데 소비됩니다. 따라서 예비 센서를 사용하는 데 과도한 지연이 없도록 신중하게 구입을 계획하는 것이 중요합니다.\n필터링된 센서 §\n화학 필터는 간섭 가스, 특히 황화수소의 영향을 제한하기 위해 일부 센서에 사용됩니다. 이러한 필터는 일반적으로 간섭 가스에 대한 내성을 나타 내기 위해 ppm / 시간으로 정의 된 제한된 수명을 갖습니다. ppm/시간 메트릭은 다양한 가스 농도에 따라 정확하지 않을 수 있습니다. 명시된 용량이 1000ppm/시간인 필터는 가스 노출의 절반으로 반드시 두 배 더 오래 지속되는 것은 아닙니다.\n간섭 가스(예: 황화수소, H2S 또는 이산화황, SO2, 센서)에 대한 센서 교차 반응은 필터가 포화됨에 따라 증가합니다. 물론 사용자는 센서가 SO2 또는 H2S에 응답하는지 확인할 수 없습니다.\n유기(탄소 기반) 필터는 효과적이지만 재생되지 않으며 주변 습도가 50%RH를 초과하여 기공이 막히면 포화될 수 있습니다. 화학 필터의 효율은 습도가 높은 환경에서 감소할 수 있습니다.\n\n 그림:  센서 장치 설치\n센서가 고장났는지 어떻게 알 수 있습니까? §\n지난 수십 년 동안 전기 화학 센서가 고장 났을 때를 결정할 수 있다고 주장하는 가스 감지기에 적용된 여러 특허와 기술이 있습니다. 그러나 이들 중 대부분은 센서가 어떤 형태의 전극 자극을 통해 작동하고 있다고 추론 할 뿐이며 잘못된 보안 감각을 제공 할 수 있습니다. 센서가 작동하고 있음을 입증하는 유일한 확실한 방법은 테스트 가스를 적용하고 응답을 측정하는 것입니다 : 범프 테스트 또는 전체 보정.\n그러나 계측기는 센서 성능에 영향을 미칠 수 있는 사고를 보고할 수 있습니다: 지능형 가스 감지기 및 트랜스미터는 주변 환경을 모니터링하고 온도가 센서의 상한 또는 하한 임계값을 초과하는 경우 경고를 생성할 수 있습니다. 트랜스미터는 또한 측정된 가스 레벨을 특정 센서의 최대 허용 한계와 비교하고 이를 초과하면 경고할 수 있습니다. 이 예에서 올바른 작업은 사용자가 테스트 가스를 사용하여 센서를 범프 테스트하여 올바르게 응답하는지 확인하는 것입니다.\n가스 센서 교체 계획 §\n센서 수명 예측은 기기 작업자가 센서 교체를 계획할 수 있도록 하고 서비스 엔지니어가 이미 교체 센서를 들고 현장에 출석하여 기기 가동 중지 시간 또는 재방문의 위험을 방지하는 데 매우 바람직합니다. 반대로, 사용자는 일상적인 센서 교체 사이의 기간을 자신 있게 연장할 수 있다면 센서 교체 비용을 줄일 수 있습니다.\n전기화학 센서 수명 예측은 매우 부정확한 과학으로, 작동 수명은 이 기사에 설명된 요인의 영향을 전적으로 받으므로 각 응용 분야에 고유합니다. 실제로 센서는 제조업체의 권장 사항 또는 이전 데이터(예: 2년 또는 3년마다)에 따라 고정된 기간에 교체되거나 테스트 가스에 부적절하게 반응할 때 교체됩니다. 정규 기간 모델에서 사용자는 센서가 항상 ‘최신’이라는 확신을 갖지만 교체된 센서의 수명이 상당히 오래 남을 가능성이 매우 높기 때문에 이러한 재보증에 대해 프리미엄을 지불할 수 있습니다. 감도가 크게 손실된 경우(또는 허용할 수 없을 정도로 긴 응답 시간)를 보이는 경우에만 교체하는 센서는 서비스 간격 사이(종종 6개월마다)에 고장날 위험이 있습니다.\n파트 2: 펠리스터 §\n\n그림.  펠리스터 센서 구성\n작동 방식 §\n‘펠리스터’라는 단어는 ‘펠릿’과 저항기의 아말감이며 촉매가 장착된 비드에 둘러싸인 작은 와이어로 구성된 센서를 설명합니다.\nPellistor 센서는 각각 세라믹 비드에 내장된 두 개의 일치하는 와이어 코일로 구성됩니다. 전류가 코일을 통과하여 비드를 약 500°C로 가열합니다. 가연성 가스가 비드에 연소되고 추가 열이 발생하면 코일 저항이 증가하여 가스 농도를 나타내기 위해 기기에서 측정됩니다. 검출 요소는 가연성 가스와 접촉 할 때 산화를 촉진하는 촉매로 코팅됩니다. 보상 요소는 촉매 산화가 발생하지 않도록 처리됩니다. 보상 요소는 환경 영향(예: 주변 온도 또는 가스 유량의 변화)으로 인해 신호가 생성되지 않도록 장착됩니다.\n기존의 펠리스터는 상대적으로 고전력 장치이고 가연성 가스를 발화시키는 온도에서 작동하기 때문에 화염방지기(소결) 뒤에 밀봉해야 합니다.\n센서 수명에 영향을 미치는 요인 §\n가스를 산화시키는 촉매 표면의 능력은 가스가 중독되거나 억제되었을 때 감소합니다. 10년을 초과하는 센서 수명은 억제 또는 중독 화합물이 존재하지 않는 응용 분야에서 드문 일이 아닙니다. 고출력 펠리스터는 촉매 활성이 더 크고 중독에 덜 취약합니다. 더 많은 다공성 비드는 또한 그들의 표면 부피가 증가함에 따라 더 큰 촉매 활성을 갖는다. 숙련된 초기 설계와 정교한 제조 공정은 최대 비드 다공성을 보장합니다.\n‘독’이라는 용어는 펠리스터 비드에 비가역적 효과를 갖는 화합물을 설명합니다. 이러한 화합물에 노출되면 대상 가스에 대한 민감도가 영구적으로 감소합니다. 유기 실리콘은 가장 일반적인 독입니다. 비드 표면과 접촉하여 화상을 입어 깨지기 어려운 실리콘-산소 결합을 생성합니다. 이것은 가스에 반응할 수 있는 비드의 면적을 감소시킵니다. 메탄에 대한 반응은 이 가스가 산화되기 가장 어렵기 때문에 가장 큰 영향을 받습니다(따라서 검출하려면 최대 비드 표면적이 필요함). 펠리스터가 메탄에 둔감해질 수 있지만 여전히 부탄, 프로판, 수소 등에 반응할 수 있습니다.\n중독 화합물의 예는 다음과 같습니다.\n• 유기 실리콘 화합물\n• 유기 금속 화합물\n• 모든 유기 금속 성분 : 납, 주석, 연료의 구리 화합물, 페인트 등\n\n 그림: 휘스톤 브리지 다이어그램\n펠리스터에 가역적 효과가 있는 화합물은 ‘억제제’로 설명됩니다. 펠리스터 감도는 화합물이 제거되면 회복됩니다.\n예제:\n• 황, 황화수소를 함유 한 화합물 (ppm의 10에서 100)\n• 할로겐 함유 탄화수소 불소 (F), 염소 (Cl), 브롬 (Br), 요오드 (I).\n높은 가스 농도(&gt;100%LEL)에 노출되면 센서 성능이 저하되고 영점/기준선 신호에 오프셋이 생성될 수 있습니다. 불완전 연소는 비드에 탄소 침전물을 초래합니다: 탄소는 기공에서 ‘성장’하여 기계적 손상을 일으킵니다. 그러나 탄소는 촉매 부위를 다시 드러내기 위해 시간이 지남에 따라 연소 될 수 있습니다. 높은 가스 노출로 인한 펠리스터 손상의 일반적인 원인은 가스 담배 라이터를 사용하는 잘못된 정보 인력 테스트 센서입니다. 이러한 부탄 연료 장치는 센서에 100% 부피 농도로 가스를 증착하여 급격한 팽창으로 인해 비드 표면에 극심한 탄소 침전물 또는 균열을 유발합니다.\n잘 설계된 가스 검지 기기는 과도한 가스 농도에 노출되어 발생하는 손상을 제한하기 위해 ‘펠리스터 저장’ 기능을 배치합니다. 기기는 측정된 가스 농도가 95%LEL을 초과할 때 펠리스터에서 전압을 제거합니다. 기기의 경보는 활성 상태로 유지되지만 가스 위험이 있음을 나타냅니다. 펠리스터 비드는 빠르게 냉각되어 탄소 형성 또는 기계적 손상의 위험을 최소화합니다. 기기가 센서가 깨끗한 공기 상태로 반환되면 수동으로 재설정할 수 있습니다.\n펠리스터 비드는 일반적으로 공급 전압이 2Vdc에 불과한 저전압 ‘Wheatsone Bridge’ 회로(위 다이어그램 참조)에서 작동하도록 설계되었습니다. 공급 전압은 특히 과도한 전압이 너무 많은 열을 발생시켜 코일이 녹을 수 있으므로 기술자가 수동으로 설정해야 하는 경우 신중하게 적용해야 합니다.\n극심한 기계적 충격이나 진동은 드물게 펠리스터 코일이 파손될 수도 있습니다. 이 문제는 고정 소수점 가스 감지기가 떨어질 가능성이 더 높기 때문에 휴대용 가스 감지기보다 휴대용에서 더 많이 발생하며 사용되는 펠리스터는 배터리 수명을 최대화하기 위해 더 낮은 전력이므로 더 섬세하고 얇은 와이어 코일을 사용합니다.\n필터 §\n\n펠리스터 센서는 일반적으로 추가 필터 없이 소결(압축된 스테인리스강 파편 디스크) 또는 메쉬만 사용합니다. 탄소 필터는 독극물이 센서에 도달하는 것을 방지하기 위해 채광 및 기타 응용 분야에서 사용될 수 있습니다. 그러나 탄소는 장쇄 탄화수소도 걸러내므로 주의해서 사용해야 합니다. 탄소 필터는 메탄 또는 수소가 주요 가스 위험인 경우에만 권장됩니다.\n소결 및 / 또는 필터는 또한 잠재적으로 밝혀지지 않은 고장 모드를 나타낼 수 있습니다 : 기공은 먼지 / 오물, 기름 등에 의해 막히고 가스가 센서에 도달하는 것을 방지 할 수 있습니다. 소결 및 필터 (사용되는 경우)는 가스를 통과시켜 정기적으로 점검해야하며 오염 징후가있는 경우 교체해야합니다.\n센서가 고장났는지 어떻게 알 수 있습니까? §\n전기 화학 전지와 마찬가지로 펠리스터가 올바르게 반응하는지 확인하는 가장 확실한 방법은 가스로 테스트하는 것입니다. 제조업체는 일반적으로 %LEL 농도 가스를 적용하여 6개월마다 펠리스터를 다시 보정할 것을 권장합니다. 그러나 교정 주파수는 전적으로 현지 조건에 따라 다릅니다. 펠리스터 감도는 독극물/억제제의 존재, 소결 또는 필터의 오염, 충격/진동의 영향 등 환경적 영향으로 인해 시간이 지남에 따라 저하됩니다.\n펠리스터는 안전하지 않을 수 있습니다: 중독된 펠리스터는 전기적으로 계속 작동하지만 가스에 반응하지 못할 수 있습니다. 따라서 가스 감지기 및 제어 시스템은 정상 상태로 보일 수 있지만 가연성 가스 누출은 감지되지 않을 수 있습니다.\n감도 열화는 기기에 의해 실제로 자동으로 모니터링될 수 없기 때문에 특히 독극물이 존재할 수 있는 환경에서 테스트 가스를 사용한 정기적인 점검 및 교정이 중요합니다. 유럽 안전 표준: EN60079-29-2:2015(폭발성 대기. 가스 감지기. 가연성 가스 및 산소에 대한 감지기의 선택, 설치, 사용 및 유지 보수)는 “검사 및 기능 점검은 장비가 작동 상태인지 확인하기위한 것입니다. 장비를 실제로 작동하는 직원이 수행하는 것이 좋으며, 특히 장비에 촉매, 전기 화학 또는 반도체 센서가 있고 힘든 조건에서 사용되는 경우 매일 사용하기 전에 수행하는 것이 좋습니다.”\n가스 센서 교체 계획 §\n전기 화학 센서에 대해 이전에 설명한 것처럼 센서 수명에 영향을 미치는 요소를 이해하고 정기적인 가스 테스트를 배치하면 펠리스터를 교체할 최적의 시기를 결정하는 데 도움이 될 수 있습니다. 센서 교체 비용을 최소화하면서 센서가 가스 위험에 효과적으로 대응할 것이라는 확신을 유지할 수 있습니다.\n승인\n이 기사에 기여한 Alphasense의 John Safell과 SGX Sensortech의 Kevin Brown에게 진심으로 감사드립니다\nUnderstanding gas sensor lifespan §\n29 NOVEMBER 2016\nIn this article, gas detection expert Andy Avenell of Crowcon outlines the factors which affect the operating lifespan of electrochemical and pellistor toxic and oxygen gas sensors. An explanation is given on how these sensors work, their normal life expectancy followed by a review of factors that can reduce operational life. Suggestions are also given to help predict sensor life and plan for replacement.\n\nIntroduction\nGas detectors are used extensively in industry to protect personnel and equipment from dangerous gases and their effects. Users of portable and fixed-point gas detectors will be very familiar with the potentially significant costs of keeping their instruments operating safely over their operational life.\nPart 1: Electrochemical sensors\nHow they work\nThese small cells contain electrodes wetted with an aqueous or gel electrolyte (often sulphuric acid: H2SO4). The working electrode is treated with a catalyst to generate a tiny current as the target gas (e.g.carbon monoxide: CO, hydrogen sulphide: H2S etc.) is either oxidised or reduced. The sensor is connected to an amplifier which is set to indicate the gas concentration in the required scale.\nElectrochemical sensors are most often used in diffusion mode whereby gas in the ambient environment enters through a hole in the face of the cell (driven by the natural mobility of the gas). Some instruments supply the air/gas sample to the sensor via a pump. A PTFE membrane is fitted over the hole to prevent water or oils from entering the cell. Sensor ranges and sensitivities can be varied in design by using different size holes. Larger holes provide higher sensitivity and resolution, whereas smaller holes reduce sensitivity and resolution but increase the range.\nGalvanic oxygen sensors operate using a similar principle to that described for electrochemical oxygen sensors, however their life is predictable and replacement periods are pre-defined: usually two or three years. Unlike most toxic gas sensors, oxygen sensors are exposed to the target gas continuously. In normal oxygen depletion monitoring applications the sensor is exposed to 20.9% volume oxygen, which causes a galvanic reaction on the lead anode which is gradually consumed by the reaction. Hence the sensors’ ability to continue producing a current in reaction to oxygen is limited by the lead content available to the electrolyte.\nThe gas detection instrument manufacturer adds a vital component to the performance of the sensor: temperature compensation. Sensitivity to gas (and also the zero base-line signal) often varies with temperature, resulting in non-linear gas response as the ambient temperature changes.\nA great deal of time is taken during the development of a gas detector, applying a number of gas concentrations to multiple sensors of the same type at temperature increments between the sensor minimum and maximum(typically -30°C to +50°C). The data collected is then averaged to produce a temperature compensation algorithm used in the gas detector to ensure the sensor reading is consistent across the full operating range.\n\nElectrochemical Sensors §\nFactors affecting sensor life\nTemperature extremes can affect sensor life. The manufacturer will state an operating temperature range for the instrument: typically -30°C to +50°C. High quality sensors will, however, be able to withstand temporary excursions beyond these limits. Short (1-2 hours) exposure to 60-65°C for H2S or CO sensors (for example) is acceptable, but repeated incidents will result in evaporation of the electrolyte and possible shifts in the base-line (zero) reading and slower response.\nSensitivity is lost at low temperatures; sensors may operate down to -40°C but will become significantly less sensitive to gas (sensitivity maybe reduced by as much as 80%) and take much longer to respond. There is also a risk the electrolyte will freeze below -35°C.\nExposure to very high gas concentrations can also compromise sensor performance.\nElectrochemical sensors are typically tested by exposure to as much as ten-times their design limit. Sensors constructed using high-quality catalyst material should be able to withstand such exposures without changes to chemistry or long-term performance loss. Sensors with lower catalyst loading may suffer damage.\nThe most significant influence on sensor life is humidity. The ideal environmental condition for electrochemical sensors is 20°Celsius and 60%RH (relative humidity). When the ambient humidity increases beyond 60%RH,water will be absorbed into the electrolyte causing dilution. In extreme cases the liquid content can increase by 2-3 times, potentially resulting in leakage from the sensor body, and then through the pins. Below 60%RH, water in the electrolyte will begin to de-hydrate. The response time may be significantly extended as the electrolyte is dehydrated.\nA quick and simple method of testing for absorption or dilution of the electrolyte is to weigh the sensor. Changes of +/-250mg of the original weight indicate a leakage or change in performance is possible. Electrolyte dilution and evaporation are reversible if the sensor is exposed to humidity levels of the opposite extreme. The sensor can return to the original weight and electrolyte concentration within 5-25 days, with performance restored.\nIt should be noted that sensor sensitivity may adjust to the ambient environment: a sensor that has a lower response or extended response time may improve as the ambient humidity changes, and this can even be dependent on the time of year in countries with large seasonal changes. Hydrogen sulphide sensor performance in particular depends on ambient conditions.  The sensitivity and response time of a sensor in a fixed-point detector is likely to change during the first two to three weeks after commissioning as it stabilises according to the local temperature and humidity. This effect will be especially prevalent where sensors have been stored in very dry environments (e.g. an air conditioned office) prior to installation.\n\nTypical Construction of an Electrochemical Sensor §\nSensor electrodes can in unusual conditions be poisoned by interfering gases that adsorb onto the catalyst or react with it, creating by-products which inhibit the catalyst.\nExtreme vibration and mechanical shocks can also harm sensors by fracturing the welds that bond the platinum electrodes, connecting strips (or wires in some sensors) and pins together. This is unusual for well-constructed sensors, however.\n‘Normal’ life expectancy\nElectrochemical sensors for common gases such as carbon monoxide or hydrogen sulphide have an operational life typically stated at 2-3 years. More exotic gas sensors such as those for hydrogen fluoride may have a life of only 12-18 months.\nIn ideal conditions, stable temperature and humidity in the region of 20°C and 60%RH with no incidence of contaminants, electrochemical sensors have been known to operate in excess of 11 years! Periodic exposure to the target gas does not limit the life of these tiny fuel cells: high quality sensors have a large amount of catalyst material and robust conductors which donot become depleted by the reaction.\nQuoted sensor ‘shelf life’ or ‘storage life’ may cause confusion and frustration for users, service companies and manufacturers alike. Electrochemical sensors typically have a stated storage life of six months from manufacture (if stored in ideal conditions at 20°C). After this period, their output signal may begin to drift. Inevitably, a small proportion of this period is consumed in the manufacture of the instrument or sensor module and in shipping to the customer. It is vital, therefore, to plan the purchase of spare sensors carefully so that there is not an excessive delay in putting them into use.\nFiltered sensors\nChemical filters are used on some sensors to limit the effect of interfering gases, particularly hydrogen sulphide. These filters usually have a limited life defined as ppm/hours to indicate their tolerance tothe interfering gas. The ppm/hour metric may be imprecise given varying gas concentrations. A filter with a stated capacity of 1000 ppm/hours will not necessarily last twice as long at half the gas exposure.\nSensor cross-response to the interfering gas (e.g. hydrogen sulphide, H2S, or sulphur dioxide, SO2, sensors) will increase as the filter becomes saturated. The user will of course not be able to determine if their sensor is responding to SO2 or H2S as this occurs.\n\nSensor unit in place §\nOrganic (carbon based) filters are effective, but they are non-regenerative and can saturate as the pores become blocked as ambient humidity exceeds 50%RH. The efficacy of chemical filters may reduce in high humidity environments.\nHow do I know when my sensor has failed?\nThere have been several patents and techniques applied togas detectors over the past few decades which claim to be able to determine when an electrochemical sensor has failed. Most of these, however, only infer that the sensor is operating through some form of electrode stimulation and might provide a false sense of security. The only sure method of demonstrating that a sensor is working is to apply test gas and measure the response: a bump test or full calibration.\nThe instrument can, however, report incidents that are likely to have affected sensor performance: intelligent gas detectors and transmitters can monitor the ambient environment and produce a warning if the temperature exceeds the upper or lower thresholds of the sensor. The transmitter can also compare the measured gas level to a maximum permissible limit for a particular sensor and warn if this is exceeded. In these examples,the correct action is for the user to bump-test the sensor using test gas to verify that it responds correctly.\nPlanning gas sensor replacement\nSensor life predication is highly desirable for instrument operators to enable sensor replacement to be planned, and also to ensure that service engineers attend site already carrying replacement sensors and thus avoid the risk of instrument down-time or re-visits. Conversely, users could reduce the cost of replacing sensors if they could confidently extend the period between routine sensor replacements.\nElectrochemical sensor life prediction is a very inexact science - operational life-spans are totally influenced by the factors described in this article and thus are unique to each application. In practice,sensors are either replaced at a fixed time period based on manufacturers’recommendations or previous data (e.g. every 2 or 3 years), or when they respond inadequately to test gas. In the regular time period model, users have assurance that sensors are always ‘fresh’, however they may be paying a premium for this re-assurance as it is very likely in many cases that the replaced sensors have significant life remaining. Sensors that are replaced only when they demonstrate a significant loss in sensitivity (or an unacceptably long response time) are at risk of failing between service intervals (often only every 6 months).\nPart 2: Pellistors\n\nPellistor Sensor Construction §\nHow they work\nThe word ‘pellistor’ is an amalgam of ‘pellet’ and resistor’, and describes a sensor which comprises a tiny wire encased in a catalyst-loaded bead.\nPellistor sensors consist of two matched wire coils, each embedded in a ceramic bead. Current is passed through the coils, heating the beads to approximately 500°C. Flammable gas burns on the bead and the additional heat generated produces an increase in coil resistance which is measured by the instrument to indicate gas concentration. The detecting element is coated with a catalyst which promotes oxidation when in contact with flammable gases; the compensating element is treated so that catalytic oxidation does not occur. The compensating element is fitted to ensure that signals are not generated due to environmental effects (e.g. changes in ambient temperature or gas flow rate).\nBecause conventional pellistors are relatively high power devices, and as they operate at a temperature that will ignite flammable gases, they need to be sealed behind a flame arrestor (sinter).\nFactors affecting sensor life\nThe capacity of the catalyst surface to oxidise the gas reduces when it has been poisoned or inhibited. Sensor life in excess of ten years is not uncommon in applications where inhibiting or poisoning compounds are not present. Higher power pellistors have greater catalytic activity and are less vulnerable to poisoning. More porous beads also have greater catalytic activity as their surface volume in increased. Skilled initial design and sophisticated manufacturing processes ensure maximum bead porosity.\nThe term ‘poison’ describes compounds that will have a non-reversible effect on the pellistor beads. Exposure to these compounds will permanently reduce sensitivity to the target gas. Organic silicone is the most common poison; it burns in contact with the bead surface and creates a silicone-oxygen bond which is difficult to break. This reduces the area of the bead available for reaction to gas. Response to methane is most affected as this gas is the most difficult to oxidise (and thus needs maximum bead surface area in order to be detected). It is possible that the pellistor can become insensitive to methane, but still react to butane, propane, hydrogen etc..\nExamples of poisoning compounds are:\n•  Organic silicon compounds\n•  Organo-metallic compounds\n•  Any organic metal component: lead, tin, copper compounds in fuels, paints etc.\n\nWheatstone Bridge Diagram §\nCompounds that have a reversible effect on the pellistor are described as ‘inhibitors’; the pellistor sensitivity will recover when the compound is removed. Examples:\n•  Compounds containing sulphur, hydrogen sulphide (10’s to 100’s of ppm)\n•  Halogen-containing hydrocarbons fluorine (F), chlorine (Cl), bromine (Br), iodine (I).\nExposure to high gas concentrations (&gt;100%LEL) may also compromise sensor performance and create an offset in the zero/base-line signal. Incomplete combustion results in carbon deposits on the bead: the carbon ‘grows’ in the pores and creates mechanical damage. The carbon may however be burned off over time to re-reveal catalytic sites. A common cause of pellistor damage from high gas exposure is ill-informed personnel testing sensors using gas cigarette lighters. These butane fuelled devices deposit gas at 100% volume concentration on the sensor causing extreme carbon deposits or even cracks in the bead surface due to sudden expansion.\nWell designed gas detection instruments deploy a ‘pellistor save’ function to limit the damage caused by exposure to excessive gas concentrations. The instrument will remove the voltage from the pellistor when the measured gas concentration exceeds 95%LEL. The alarm on the instruments will remain active however indicating that there is a gas hazard. The pellistor bead will quickly cool minimising the risk of carbon formation or mechanical damage. The instrument can be reset manually once the sensor is returned to clean air conditions.\nThe pellistor beads are designed to operate in a low voltage ‘Wheatsone Bridge’ circuit (see diagram above) with a supply voltage typically of only 2Vdc. The supply voltage must be carefully applied, especially where it has to be set manually by a technician as excessive voltage will create too much heat and cause the coils to melt.\nExtreme mechanical shock or vibration can in rare cases also cause a break in the pellistor coils. This issue is more prevalent on portable rather than fixed-point gas detectors as they are more likely to be dropped, and the pellistors used are lower power (to maximise battery life) and thus use more delicate thinner wire coils.\nFilters\nPellistor sensors generally only use a sinter (a disk of compressed stainless steel fragments) or mesh without additional filters. Carbon filters may be used in mining and other applications to prevent poisons from reaching the sensor. These should be used with care, however, as the carbon will also filter-out long-chain hydrocarbons. Carbon filters are only recommended where methane or hydrogen are the primary gas risk.\nThe sinter and/or filter may also present a potential unrevealed failure mode: the pores can become blocked by dust/dirt, oil etc and prevent gas from reaching the sensor. The sinter and filter (if used) must be checked regularly by passing gas through, and replaced if there are signs of contamination.\n\nHow do I know when my sensor has failed?\nAs with electrochemical cells, the surest way to determine that a pellistor will correctly respond is to test it with gas. Manufacturers typically recommend that pellistors are re-calibrated every six months by applying %LEL concentration gas. The calibration frequency is entirely dependent on local conditions however. Pellistor sensitivity will degrade over time due to environmental influences: presence of poisons/inhibitors, contamination of the sinter or filter, effects of shock/vibration etc.\nPellistors may not fail safe: a pellistor that has been poisoned remains electrically operational but may fail to respond to gas. Hence the gas detector and control system may appear to be in a healthy state, but a flammable gas leak may not be detected.\nSensitivity degradation cannot practically be automatically monitored by the instrument, which is why regular checks and calibration with test gas are vital, especially in environments where poisons may be present. The European safety standard: EN60079-29-2:2015 (Explosive atmospheres. Gas detectors. Selection, installation, use and maintenance of detectors for flammable gases and oxygen) states: “Inspection and functional checks are intended to verify that the equipment is in a working state. It is recommended that they are done by personnel actually operating the equipment, and is performed before each day of use, particularly if the equipment has catalytic, electrochemical, or semiconductor sensors and is being used under arduous conditions.”\nPlanning gas sensor replacement\nAs described previously for electrochemical sensors, understanding factors that affect sensor life and deploying regular gas tests can help to determine the optimum time to replace pellistors. Sensor replacement costs can be minimised whilst retaining confidence that the sensor will respond to gas hazards effectively.\nAcknowledgements\nSincere thanks to John Saffell of Alphasense and Kevin Brown of SGX Sensortech for their  contribution to this article.\nContact Details and Archive… §\n\nCrowcon Detection Instruments\n"},"가스센서/가스센서에대하여/가스센서개발-및-시스템":{"title":"가스센서개발 및 시스템","links":["tags/가스센서개발"],"tags":["가스센서개발"],"content":"#가스센서개발\n"},"가스센서/가스센서에대하여/센서-SELF-CHECK":{"title":"센서 SELF CHECK","links":[],"tags":[],"content":"출처: Low-Power Carbon Monoxide (CO) Detector BLE 10-Year Battery Life Design Guide (Rev. C) (ti.com)\n출처문서tidubx8c\n다운로드\n2.4.1.3 센서 자체 점검 §\n가스 센서의 기능은 오류가 신호를 보내 호스트에 보고될 수 있도록 지속적으로 모니터링 되어야 합니다. 이 TI 디자인은 TGS5342 CO 센서 기술 문서에서 Figaro가 설명한 자체 점검 회로의 수정된 버전을 구현합니다.\n자가 점검 기능은 센서가 TIA에서 분리된 상태에서 짧은 시간(약 4~5초) 동안 작은 테스트 전류(약 1µA)를 센서에 인가한 다음 테스트 후 센서 응답을 모니터링 하는 것으로 구성됩니다. 전류가 제거됩니다. MCU는 테스트 전류에 대한 센서 응답을 분석하여 센서가 정상적으로 작동하는 시기와 단락, 개방 회로 및 감도 손실과 같은 여러 고장 조건을 결정할 수 있습니다.\n이 참조 설계에서 자체 검사 기능은 I/O 핀 중 하나를 통해 MCU에 의해 제어됩니다(섹션 2.4.2의 그림 9 참조). 테스트를 시작하기 위해 MCU는 I/O 핀을 로직 하이로 구동합니다. 이 작업으로 인해 p-채널 JFET Q2가 꺼지고 TIA에서 센서의 연결이 끊어집니다. I/O 핀은 저항 R5를 통해 센서에 직접 테스트 전류를 공급합니다. 테스트 전류를 중지하기 위해 MCU는 I/O 핀을 로우로 구동하고 이 시점에서 JFET가 켜지고 센서가 다시 TIA에 연결됩니다.\n이 레퍼런스 디자인은 자체 점검 회로를 위해 Fairchild의 MMBFJ270 JFET를 사용합니다. MMBFJ270의 최대 게이트-소스 차단 전압 VGS(off)는 2.0V로 MCU I/O 핀의 최소 VOH 2.68V로 충족할 수 있습니다. R5 값은 최소 VOH가 2.68V라고 가정하여 센서에 약 1µA의 전류를 공급하도록 선택되었습니다.\n그림 5는 테스트 전류가 5초 동안 인가되고 제거된 후의 “정상” 센서 응답을 보여줍니다. MCU는 테스트 전류가 제거된 후 1초 후에 TIA의 출력 전압을 모니터링합니다.\nTIA 출력 전압이 2.3V보다 크면 센서와 TIA 회로가 작동하는 것으로 간주됩니다.\n![[Selfcheck_fig5.png|center|500]]\n그림 6은 센서가 정상적으로 작동할 때의 센서 응답을 보여줍니다. 이 경우 센서는 소량의 CO 가스에 노출되므로 TIA 출력 전압은 0V보다 큽니다.\n센서 응답은 TIA 출력이 0V 대신 CO 가스 농도에 해당하는 전압을 안정화한다는 점을 제외하고는 그림 5에 표시된 경우와 같습니다.\n![[Selfcheck_fig6.png|center|500]]\n그림 7은 센서가 개방 회로 상태일 때 센서 응답을 보여줍니다. 이 경우 테스트 펄스가 인가되는 동안이나 이후에 TIA에서 출력이 없습니다.\n![[Selfcheck_fig7.png|center|500]]\n그림 8은 센서가 단락 상태일 때 센서 응답을 보여줍니다. 이 경우 테스트 펄스가 인가되기 전후에 TIA의 출력에 작은 전압이 있습니다. 테스트 펄스 동안 TIA 출력 전압은 TIA 연산 증폭기의 V+ 또는 V- 레일로 이동합니다. 이 경우 출력은 V- 레일(GND)로 이동합니다.\n센서가 단락되면 단락은 본질적으로 Q2의 RDS_ON이 이득 저항으로 작동하고 RF1이 피드백 저항으로 작동하는 비반전 증폭기를 생성합니다. TIA 연산 증폭기의 전압 오프셋이 증폭되어 TIA 출력을 구동합니다. 전압 오프셋은 opamp에 따라 달라지므로 TIA 출력 전압도 달라집니다.\n![[Selfcheck_fig8.png|center|500]]\n“정상” 센서(그림 5 및 그림 6), 개방 센서(그림 7) 및 단락 센서(그림 8)의 차이점은 펌웨어에서 작동하는 센서와 작동하지 않는 센서를 식별하는 데 사용할 수 있습니다. 그러나 개방 센서 단락 센서의 TIA 응답은 매우 유사하게 보일 수 있습니다.\n따라서 단락 및 개방 센서 조건을 구별할 수 없습니다.\n테스트 전류가 인가된 후 센서가 복구되는 데 시간이 걸리며 테스트 전류가 더 긴 시간 동안 인가되면 더 긴 시간이 걸립니다. 이 기간 동안 CO 가스 샘플링은 신뢰할 수 없으며 사용할 수 없습니다. 또한 센서 테스트 중에 시스템 전력이 증가하여 배터리 수명이 단축됩니다. 이러한 이유로 센서 테스트 사이의 시간은 가능한 한 최대화되어야 합니다. 이 레퍼런스 디자인에 사용된 펌웨어는 테스트 전류가 인가된 후 센서가 복구되는 데 30초를 허용합니다.\n센서는 5분마다 테스트됩니다. 센서 테스트 중 시스템 전력 소비에 대한 자세한 내용은 섹션 3.2.2.1.1 및 섹션 3.2.2.1.5를 참조하십시오.\n"},"가스센서/가스센서에대하여/전기화학식-가스-센서의-기술적-과제를-해결하는-통합-솔루션":{"title":"전기화학식 가스 센서의 기술적 과제를 해결하는 통합 솔루션","links":[],"tags":[],"content":"https://hellot.net/news/article.html?no=48883\n전기화학식 가스 센서는 그 연원이 1950년대까지 거슬러 올라가는 검증된 기술이다. 당시에는 산소 감지 용도로 개발되었다. 이 기술이 맨 처음 적용된 애플리케이션 중하나는 글루코스 바이오센서로서, 이 센서를 사용해 글루 코스에서의 산소 결핍을 측정했다. 이후 수십 년이 지나 면서 기술은 점점 더 진화했고, 이제는 극소형 센서로 다양한 기체들을 측정할 수 있게 되었다.\n센서 기술이 점점 더 보편적으로 사용되면서, 여러 분야 에서 다양한 방식의 새로운 가스 센싱 애플리케이션이 등장하고 있다. 자동차 실내 공기질 모니터링과 전자 코 같은 것들이 그러한 사례들이다. 관련 규정이나 안전성 요건이 갈수록 엄격해짐에 따라 새로운 애플리케이션이나 기존 애플리케이션 모두 요구사항이 점점 까다로워지고 있다. 향후에는 가스 센싱 시스템이 훨씬 더 낮은 농도를 정확히 측정할 수 있어야 하고, 목표 기체에 대한 선택도가 우수해야 하고, 배터리 전원을 사용해서 더 오래 작동할 수 있어야 하고, 장시간에 걸쳐 일관된 성능을 제공하 면서 또 안전하고 신뢰성 있게 작동해야 한다.\n전기화학식 가스 센서의 장단점\n전기화학식 가스 센서가 인기가 있는 이유는 출력 선형 성, 저전력 소모 특성, 우수한 분해능 때문이다. 또한 목표 기체에 대해 알려진 농도로 교정했을 때 측정의 반복정 밀도(repeatability)와 정확도도 뛰어나다. 수십 년에 걸쳐 기술이 발전함에 따라, 이들 센서들은 특정 목표 기체에 대해 매우 우수한 선택도를 제공할 수 있게 되었다. 이 같은 다양한 장점들 때문에 전기화학식 센서를 가장 먼저 채택한 애플리케이션은 산업용 분야로서, 용도는 작업자 안전을 보장하기 위한 독성 가스 탐지용이었다. 가격이 저렴해지면서 이들 센서를 경제적으로 사용할 수 있게 되자 광산, 화학 산업, 바이오가스 플랜트, 식품 제조, 제약 등과 같은 다양한 산업 분야에서도 유해 가스 모니터링 시스템을 구축해서 작업자들을 위한 안전한 환경 조건을 유지할 수 있게 되었다.\n센싱 기술 자체는 계속해서 진화해 왔으나, 기본적인 작동 원리는 그리 크게 달라지지 않았으며 그에 따라 기존 단점들도 그대로 남아 있다. 통상적으로 전기화학식 센서는 보관 수명(shelf life)이 6개월에서 1년으로 제한적이 다. 센서의 노후화 역시 장기적 성능에 상당한 영향을 미친다. 센서 제조회사들은 센서 감도가 연간 최대 20%까지 변화될 수 있다고 명시하고 있다. 뿐만 아니라 목표 기체 선택도가 크게 향상되기는 했으나, 여전히 다른 기체들에 대한 교차 선택도 때문에 애를 먹고 있으며, 이 문제 때문에 측정 과정에서 간섭이나 오판독이 발생할 수 있다. 또한 센서들은 온도의 영향을 받을 수 있으므로 내부적으로 온도 보정을 해야 한다.\n기술적 과제\n첨단 가스 센싱 시스템을 설계할 때 해결해야 할 기술적 과제들은 시스템 수명 단계에 따라서 크게 세 가지로 분류할 수 있다.\n첫째, 제조 반복정밀도, 센서 특성분석, 교정 등 센서 제조와 관련한 과제들이다. 고도로 자동화한다고 하더라도 제조 공정 자체에서 각 센서마다 불가피하게 차이가 발생할 수 있다. 따라서 제조 과정에서 센서에 대한 특성분석과 교정을 해야 한다.\n둘째, 시스템을 사용하면서 해결해야 할 기술적 과제들이 있다. 시스템 아키텍처 최적화가 대표적인 사례다. 이것은 신호 체인 설계나 전력 소모 등과 관련된다. 특히 산업용 애플리케이션에서는 전자파 적합성(EMC)과 기능 안전성 요건을 충족해야 하므로, 이는 설계 비용과 시간에 불리하게 영향을 미칠 수 있다. 작동 조건 역시 중요한 역할을 하며, 요구되는 성능과 수명을 달성하는데 영향을줄 수 있다. 전기화학식 센서는 특성상 시간이 지날수록 노후화와 드리프트를 일으키므로, 자주 교정을 하거나 필요하면 센서를 교체해야 한다. 특히 열악한 환경에서 작동하면 이러한 성능 변화가 더 심해질 수 있다. 성능을 유지하면서 센서의 수명을 연장하는 것이 많은 애플리케이 션에서 중요한 요구사항이며, 시스템 유지비용을 절감하 고자 하는 경우에는 더욱 그럴 것이다.\n셋째, 수명을 연장하기 위한 어떤 방법을 동원하더라도 모든 전기화학식 센서는 결국에는 성능이 떨어져 센서를 교체해야 하는 시점에 도달할 수밖에 없다. 따라서 이 센 서들의 실질적인 수명 종료 시점을 감지하는 것 또한 과제 이며, 이 과제를 해결하기만 한다면 불필요한 센서 교체를 줄임으로써 상당한 비용을 절감할 수 있을 것이다. 한발 더 나아가 센서가 언제쯤 고장이 날 것인지까지 정확하게 예측한다면 가스 센싱 시스템의 운용 비용을 절감할 수있다.\n모든 유형의 가스 센싱 애플리케이션에서 전기화학식 가스 센서 사용이 증가하고 있으며, 이 때문에 이러한 시스 템의 조달, 커미셔닝, 유지보수와 관련한 과제들이 제기 되고 있다. 이는 곧 총 유지비용 증가로 이어진다. 따라서 진단 기능을 통합한 전문적인 아날로그 프론트 엔드를 사용하면, 제한적인 센서 수명을 비롯한 이 기술의 단점들을 완화하고 가스 센싱 시스템의 장기적인 지속가능성과 신뢰성을 달성할 수 있다.\n신호 체인 통합으로 설계 복잡성 완화\n기존 신호 체인은 아날로그-디지털 컨버터(ADC), 증폭 기, 그 밖에 다른 빌딩 블록들을 개별적으로 사용하기 때문에 설계하기가 복잡하고 전력 효율, 측정 정밀도, 신호 체인이 차지하는 PCB 면적 등 여러 모로 불리했다.\n일례로 여러 유형의 기체를 측정하기 위한 다중 기체 측정장비가 있다고 가정해 보자. 이 장비가 적절히 작동하기 위해서는 각 센서마다 서로 다른 바이어스 전압이 필요할 것이다. 게다가 각 센서마다 선택도가 다를 수도 있다. 그러니 신호 체인 성능을 극대화하려면 증폭기 이득을 조절 해야 한다. 설계자 관점에서는 이 두 가지만으로도 소자나 회로도를 변경하지 않고는 다른 센서들과 인터페이스할 수 있는 구성 가능한 측정 채널을 설계하기가 복잡해질 것이다. 그림 1은 단일 측정 채널의 블록 다이어그램을 보여준다.\n다른 모든 전자 시스템들과 마찬가지로, 기능 집적도를 높이는 것이 자연스러운 진화의 과정이다. 이를 통해 더효율적이고 강력한 성능의 솔루션을 설계할 수 있다. 집적도 높은 단일 칩 가스 센싱 신호 체인을 사용함으로써 시스템 설계를 간소화할 수 있다. 예를 들어 트랜스임피 던스 증폭기(TIA) 이득 저항을 통합하거나 DAC를 센서 바이어스 전압 소스로 사용할 수 있다(그림 2). 신호 체인 통합 덕분에, 측정 채널이 다양한 유형의 전기화학식 센서들과 인터페이스 할 수 있도록 소프트웨어를 이용해 완벽하게 구성 가능하게 할 수 있으며, 그 결과 설계 복잡성을 낮출 수 있다. 뿐만 아니라 이러한 통합적인 신호 체인은 전력 소모가 눈에 띄게 줄어든다. 이 점은 배터리 사용 시간이 중시되는 애플리케이션에서 특히 유용한 특성이 다. 또한 신호 체인의 잡음 수준이 낮아지고 TIA나 ADC 같은 신호 처리 소자들을 활용해서 측정 정확도를 높일 수있다.\n앞서 언급한 다중 기체 측정 장비의 경우, 신호 체인 통합 을 통해 다음과 같은 이점을 거둘 수 있다:\n◇ 완벽하게 구성 가능한 측정 채널을 구현하여 신호 체인 복잡성을 낮출 수 있고, 이를 통해 단일 신호 체인 설계를 손쉽게 재사용할 수 있다.\n◇ 신호 체인이 차지하는 PCB 면적을 줄일 수 있다.\n◇ 전력 소모를 줄일 수 있다.\n◇ 측정 정확도를 향상할 수 있다.\n센서 성능 저하 및 진단\n신호 체인 통합이 여러 면에서 장점을 제공하기는 하지 만, 그렇다고 전기화학식 가스 센서의 근본적인 약점을 해결하는 것은 아니다. 즉, 시간이 지날수록 센서 성능이 저하되는 것 말이다. 이는 센서의 작동 원리와 구조에 기인해서 발생하는 약점이다. 센서의 정확도가 점점 더 떨어지다가 어느 시점에 이르러서는 더 이상 신뢰할 수 없고 임무 수행에 부적합하게 된다. 이럴 때 기존의 관행은 장비 가동을 중단하고 수작업으로 센서를 검사하는 것인데, 이렇게 하면 시간과 비용이 많이 든다. 센서를 검사한 다음에는 센서를 교정해서 다시 사용하거나, 아니면 센서를 교체해야 할 수도 있는데, 이는 유지보수 비용을 증가시 킨다. 이럴 때 전기화학적 진단 기법을 사용해서 센서의 건전성 상태를 분석하고 달라진 성능을 효과적으로 보정할 수 있다.\n\n그림 1. 전기화학식 가스 센서 신호 체인\n\n그림 2. 통합적인 듀얼 채널 가스 센싱 신호 체인\n\n그림 3. 낮은 상대 습도로 가속화 수명 테스트를 했을 때 센서 선택도(왼쪽)와 임피던스(오른쪽)의 상관관계\n성능 저하를 일으키는 주된 요인들로는 극단적인 온도, 습도, 기체 농축, 전극 피독 현상(electrode poisoning) 등을 들 수 있다. 높은 온도(50°C 이상)에 짧은 시간 동안 노출되는 것은 허용될 수 있다. 하지만 센서에 반복적으로 고온이 가해지면 전해액이 기화해서 센서에 되돌릴 수없는 손상을 일으킬 수 있다. 예를 들어 베이스라인 판독에 오프셋이 일어나거나 반응 시간이 느려질 수 있다. 반면에 극단적인 저온(-30°C 미만)은 센서의 감도와 반응성을 현저히 떨어트릴 수 있다.\n습도는 센서 수명에 심각한 영향을 미친다. 전기화학식 가스 센서의 이상적인 동작 조건은 20°C의 온도와 60%의 상대 습도이다. 주변 습도가 60% 이하이면 센서 내부의 전해액이 말라, 반응 시간에 영향을 미친다. 반면에 습도가 60% 이상이면 공기 중의 수분이 센서로 흡수되어서 전해액을 묽게 하고 센서 특성에 영향을 미친다. 또한 수분 흡수는 센서에서의 수분 누출을 유발해 핀들을 부식할 수도 있다.\n이러한 성능 저하 메커니즘은 그 정도가 심하지 않더라도 센서에 영향을 미친다. 예컨대 자연적인 전해액 고갈을 일으켜 센서 노후화에 영향을 미칠 수 있다. 노후화는 동작 조건에 상관없이 센서 수명을 단축한다. 다만 일부 전기화학식 가스 센서는 작동 수명이 10년 이상에 이르기도 한다.\n센서를 분석하기 위해서는 전기화학 임피던스 분광법 (EIS)이나 크로노암페로메트리(chronoamperomety), 즉바이어스 전압 펄스를 인가하여 센서 출력을 관찰하는 기법 등을 사용할 수 있다.\nEIS는 전기화학식 시스템을 주로 전압인 사인파 신호를 이용해 여자함으로써 수행하는 주파수 도메인 분석 측정 이다. 각각의 주파수에서, 전기화학 셀을 통해서 흐르는 전류를 기록하고 이를 사용해서 셀의 임피던스를 계산할수 있다. 그런 다음 이 데이터를 나이퀴스트 플롯이나 보드 플롯의 형태로 제공할 수 있다. 나이퀴스트 플롯은 복소수 임피던스 데이터를 보여준다. x 축 상에 실수 부분과 y 축 상에 허수 부분으로 매 주파수 점을 표시한다. 이 데이터 표현 방식의 가장 큰 단점은, 주파수 정보를 잃는다는 것이다. 보데 플롯(Bode plot)은 주파수에 따른 임피 던스 크기와 위상각을 보여준다.\n시험 결과를 보면, 센서 감도 저하와 EIS 테스트 결과 사이에 강한 상관관계가 있다는 것을 알 수 있다. 그림 3은 가속화 수명 테스트 결과를 나타낸 것으로, 테스트에서는 전기화학식 가스 센서에 낮은 습도(10% RH)와 높은 온도 (40°C) 조건을 인가했다. 센서는 주기적으로 환경 체임버 에서 꺼내어 한 시간씩 안정화시켰다. 그런 다음 알려진 목표 기체 농도로 베이스라인 감도 테스트와 EIS 테스트를 실시했다. 이 테스트 결과를 보면, 센서 감도와 임피던스 사이에 확실히 상관관계가 있다는 것을 알 수 있다. 이측정 방법의 단점은 시간이 걸린다는 것이다. 서브 Hz의 낮은 주파수로 측정 결과를 포착하는 데 시간이 많이 걸리기 때문이다.\n크로노암페로메트리(펄스 테스트)는 센서 건전성 분석을할 수 있는 또 다른 방법이다. 이 측정 방법은 센서 바이어스 전압과 함께 전압 펄스를 인가하고 전기화학 셀을 통해서 흐르는 전류를 관찰하는 것이다. 펄스 진폭이 대체로 매우 낮고(가령 1mV) 순간적이므로(가령 200ms), 센서를 방해하지 않는다. 따라서 가스 센싱 장비를 정상적으로 가동하면서 테스트를 빈번하게 실시할 수 있다. 크로 노암페로메트리를 사용해서 센서가 물리적으로 디바이스에 연결되어 있는지 확인할 수 있고, 이를 통해 센서 성능이 변화되는 것을 감지하고, 그에 따라 좀더 시간 소모적인 EIS 측정을 할 수 있다. 그림 4는 전압 펄스에 대한 센서 응답을 예시한 것이다.\n\n그림 4. 크로노암페로메트리 테스트 결과\n종전의 센서 질의 기법은 전기화학 분야에서 수십 년 동안 사용되어 온 것이다. 그런데 이 측정에 필요한 장비는 가격이 비싸고 크기도 크다. 실용적 관점에서나 비용적 관점에서나 현장에 설치되어 있는 대량의 가스 센서들을 테스트하기 위해서 이러한 장비를 사용하는 것은 현실적이지 않다. 신호 체인에 진단 기능을 직접 내장하면 센서에 대한 건전성 분석을 원격으로 할 수 있다.\n진단 기능을 통합하면 사람이 개입하지 않고도 자율적으로 가스 센서를 테스트할 수 있다. 생산 과정에서 가스 센서에 대한 특성을 분석을 하면 센서가 수집한 데이터를 이특성분석 데이터와 비교해서 현재의 센서의 상태에 관한 통찰을 얻을 수 있다. 그런 다음 스마트 알고리즘을 사용 해서 센서 감도를 보정할 수 있다. 뿐만 아니라 센서 이력을 기록함으로써 교체 시점도 예측할 수 있어, 센서 교체 시기를 사용자에게 알려줄 수 있다. 진단 기능을 통합하면 궁극적으로 가스 센싱 시스템의 유지보수를 줄이고 센서의 작동 수명을 길게 할 수 있다.\n산업용 애플리케이션의 시스템 설계 과제\n산업용으로는 안전성과 신뢰성이 중요하기 때문에 산업용 애플리케이션에는 엄격한 규정들이 적용된다. 화학 공장 같은 열악한 산업용 환경에서 가스 센싱 시스템이 신뢰성 높게 작동하기 위해서는 이러한 규정들을 충족해야 한다.\nEMC는 다양한 전자 장비들이 공통적인 전자기 환경에서 상호 간섭을 일으키지 않고 적절히 동작할 수 있는 능력을 말한다. EMC와 관련해서 복사 방사나 복사 내성 같은 것들을 테스트한다. 방사 테스트는 어떤 시스템이 원치 않는 방사를 얼마나 발생하는지를 테스트하는 것이고, 복사 내성 테스트는 다른 시스템들로부터 간섭이 존재하는 가운데 자신의 기능성을 얼마나 유지할 수 있는가를 테스트 하는 것이다.\n전기화학식 가스 센서는 구조 자체가 EMC 성능에 부정적인 영향을 미친다. 센서 전극이 안테나로서 작용함으로써 인근의 전자 시스템으로부터 간섭을 끌어들일 수 있다. 작업자 안전을 위한 휴대용 기기 같은 무선 연결 가스 센싱 디바이스는 이 영향이 더 심해질 수 있다.\nEMC 테스트는 대체로 시간이 많이 걸리며, 최종 시험을 통과하기까지 시스템을 여러 번 수정해야 할 수 있기 때문에 제품 개발에 상당한 비용과 시간이 걸릴 수 있다. 따라서 EMC 시험을 이미 통과한 통합적인 신호 체인 솔루션을 사용한다면 이 시간과 비용을 크게 단축할수 있다.\n또 다른 중요한 고려사항이자 기술적 과제는 기능 안전성 (functional safety)이다. 기능 안전성은 위험을 일으킬 가능성이 있는 조건들을 감지하고 보호 조치나 교정 조치를 취해서 위험한 상황이 발생하지 않도록 하는 것을 말한 다. 이러한 안전 기능이 제공하는 위험 저감 능력을 판단할 수 있게 한 것이 SIL(safety integrity level) 등급이 다. 산업용 표준들은 당연히 이러한 기능 안전성 요건을 조건으로 명시하고 있다.\n산업용 가스 센싱 애플리케이션에서 기능 안전성은 주로 특정한 환경에서 안전하게 작동하는 것과 관련된다. 산업용 환경에는 폭발성 가스나 가연성 기체가 존재할 수 있기 때문이다. 화학 공장이나 광산 등이 그러한 예이다. 기능 안전성 표준을 충족하려면, 해당 시스템은 요구되는 SIL 등급에서 안전하게 작동하는지를 확인받아야 한다.\n아나로그디바이스의 단일 칩 전기화학 측정 시스템\n앞서 열거한 요건들을 충족하고, 고객들이 보다 지능적이고 정확하며 경쟁력 있는 가스 센싱 시스템을 설계할 수있도록 하기 위해 아나로그디바이스는 가스 센싱 및 물 분석 애플리케이션을 위한 단일 칩 전기화학 측정 시스템 ADuCM355를 출시했다.\nADuCM355는 2개의 전기화학 측정 채널, 센서 진단용 임피던스 측정 엔진, 사용자 애플리케이션과 센서 진단및 보정 알고리즘을 실행하기 위한 초저전력 혼성신호 ARM®Cortex®-M3마이크로컨트롤러를 포함한다. 그림 5는 ADuCM355의 기능 블록 다이어그램이다.\n\n그림 5. ADuCM355의 기능 블록 다이어그램\n아나로그디바이스는 시장의 동향과 고객들의 요구를 반영해서 다음과 같은 기능들을 통합한 고집적 온칩 측정 시스템을 개발했다. ◇ 16비트 400kSPS ADC\n◇ 2개의 듀얼 출력 DAC(전기화학 셀에 바이어스 전압 제공)\n◇ TIA 증폭기를 포함하는 2개의 초저전력 저잡음 정전 위기(potentiostat)\n◇ 고속 TIA를 내장한 고속 12비트 DAC\n◇ 진단 기능을 위한 아날로그 하드웨어 가속기(파형 생성기, 디지털 퓨리에 변환 블록, 디지털 필터)\n◇ 내장형 온도 센서\n◇ 26MHz ARM Cortex-M3 마이크로컨트롤러 ADuCM355를 사용함으로써 전기화학식 가스 센싱의 기술 과제들을 해결할 수 있다. 2개의 측정 채널은 널리 사용 되고 있는 3전극 가스 센서뿐 아니라 4전극 센서 구성도 지원한다. 네 번째 전극은 진단용으로 사용하거나, 듀얼 가스 센서의 경우에 두 번째 기체에 대한 작업 전극으로 사용할 수 있다. 또한 어떤 정전위기든 동면하도록 구성해서 센서 바이어스 전압을 유지하면서 전력 소모를 낮출 수있다. 따라서 센서가 적절히 동작하도록 안정화하는데 걸리는 시간을 단축할 수 있다.\n아날로그 하드웨어 가속기 블록은 EIS나 크로노암페로메트리 같은 센서 진단 측정을할 수 있다. 또한 마이크로컨트롤러를 통합하고 있어 보상 알고리즘을 실행하고, 교정 파라미터를 저장하며, 사용자 애플리케이션을 실행할 수 있다. ADuCM355는 EMC를 수월하게 충족하도록 설계되었으며, EN 50270 표준 충족에 관한 사전 시험을 받았다.\n한편, 아나로그디바이스는 마이크로컨트롤러가 필요 없는 애플리케이션을 위해 프론트 엔드만을 포함하는 AD5940도 제공한다.\n맺음말\n지속적인 기술 혁신 덕분에, 전기화학식 가스 센서가 보편적으로 활용되는 데 걸림돌이 되었던 기술적 과제들을 극복할 수 있게 되었다. 저렴한 가격대의 무선 공기질 모니터링에서부터 공정 제어와 작업자의 안전을 보장하기 위한 애플리케이션에 이르기까지, 진단 기능을 내장한 통합적인 신호 체인을 사용함으로써 이러한 센서들을 좀더 보편적으로 사용해서 유지보수를 줄이고, 정확도를 높이 고, 센서 수명을 길게 하고, 비용을 절감할 수 있다.\n글 / 미칼 라니넥(Michal Raninec) 아나로그디바이스(Analog Devices, Inc.) 시스템 애플리케이션 엔지니어"},"가스센서/가스센서에대하여/참고":{"title":"참고","links":[],"tags":[],"content":"wikipedia 가스센서 카테고리 https://en.wikipedia.org/wiki/Category:Gas_sensors\n가스 감지기 https://en.wikipedia.org/wiki/Gas_detector\n가스 센서 https://m.blog.naver.com/iotsensor/221624957675\nhttp://wiki.hash.kr/index.php/%EA%B0%80%EC%8A%A4%EC%84%BC%EC%84%9C\n\n〈가스 센서〉, 《자동차용어사전》\n이덕동 교수, 〈가스센서와 센서어레이〉, NASECDED1\n함예솔, 〈어디서든 실시간 감지하는 유해가스 센서〉, 《이웃집과학자》, 2020-09-04\n제프 비을라, 〈자동차용 센서를 통해 살펴보는 ‘자동차 인증 획득’의 의미〉, elec4, 2017-09-07\n천동기, 〈60호 주목받는 비분산적외선 가스센서란 무엇인가〉, 《디바이스마트&amp;엔티렉스 컨텐츠》, 2020-06-30\n센서로세계로미래로, 〈반도체식 가스센서〉, 《네이버 블로그》, 2015-03-13\n\n경북대학교 허증수 교수 http://hlc.or.kr/sub04/detail.php?UNIV=1&amp;No=347\nhttps://pksafety.com/blog/a-brief-history-of-gas-detection\n가스검지기 역\nhttps://7solutions.eu/7solutions-blog/a-brief-history-in-gas-detection-coal-mine-canaries-flame-safety-lamps\nhttps://www.heatingandprocess.com/gas-detection/\nhttps://www.21-senses.com/the-evolution-of-gas-sensing-over-the-years-a-brief-history/\n이산화탄소센서의 개발 역사\nhttps://www.rikasensor.com/the-development-history-of-carbon-dioxide-sensors.html\n화학반응성 가스 센서의 첫 50년 §\nhttps://www.mdpi.com/2227-9040/3/1/1\nhttps://www.sgxsensortech.com/content/uploads/2014/08/Introduction-to-Pellistor-Gas-Sensors.pdf\nhttp://www.china-oceanus.com/html/0612843422.html"},"가스센서/동작방식분류/CO2/Ndir-적외선-가스센서":{"title":"Ndir 적외선 가스센서","links":[],"tags":[],"content":"ndir 적외선 가스센서 질문 드립니다. : 네이버 카페 (naver.com)\n\n적외선 센서를 이용해서 가스를 측정 해야 하는데 처음 접해보는거라 구글 검색해보면서 이해가 가지 않는부분이 있어 질문 드립니다.\n​\nCO나 CO2 등 가스상물질들이 적외선에 대해 특정한 흡수스펙트럼을 갖는 것을 이용해서 특정성분의 농도를 구하는 방법으로 대기 및 굴뚝 가스중의 요염물질을 연속적으로 측정하는 비분산 정필터형 적외선 가스분석계에 대해 적용한다.\n가스상물질의 흡수도는 lambert_beer법칙에 의해 지배를 받는다\n​\n식으로는\n\n제가 궁금한게 I = 투과광량( 즉 계산된 최종 ppm값인지)\nIo : 입사광량은 어떤걸 의미하는지\nA : 고유상수 (Co의 흡수율은) = co의 파장대를 의미(4.64um)??\nC : 성분농도 (CO 배출하고 있는 현재 농도?)\n​\n===\n제가 궁금한게 I = 투과광량( 즉 계산된 최종 ppm값인지)\n→ IR Lamp 에서 1 이라는 빛을 발생시켰을때 detector 에 도달하는 빛의 양을 의미합니다.\nIo : 입사광량은 어떤걸 의미하는지\n→ IR Lamp 에서 발생된 빛의 양을 의미합니다.\nA : 고유상수 (Co의 흡수율은) = co의 파장대를 의미(4.64um)??\n→ IR Lamp 에서 발생된 빛이 CO2 에 의해 흡수되는 비율을 의미합니다. IR Lamp 의 파장이 달라지면 흡수율 또한 당연히 달라집니다.\nhttps://www.cell.com/heliyon/pdf/S2405-8440(18)32460-5.pdf\nC : 성분농도 (CO 배출하고 있는 현재 농도?)\n→ CO2 농도를 의미합니다.\n"},"가스센서/동작방식분류/MPS(네바다나노)":{"title":"MPS(네바다나노)","links":["MPS-Senso-datasheet.zip"],"tags":[],"content":"Transclude of MPS-Senso-datasheet.zip\nLEL-MPS Combustible Gas Sensor §\nhttps://youtu.be/JyH7FkKapNc?si=cC7DDNxaCSx91ZGx"},"가스센서/동작방식분류/PID/PID-GAS-SENSOR":{"title":"PID GAS SENSOR","links":["tags/PID","minipid2_brochure_v1.3_uk-min.pdf","Sensor-Part-Numbers.docx"],"tags":["PID"],"content":"#PID\nionscience §\n[Pioneering Gas Sensing Technology - ION Science Ltd](https://ionscience.com/en\nminipid2_brochure_v1.3_uk-min.pdf\nSensor Part Numbers.docx\n"},"가스센서/동작방식분류/초음파/초음파-감지기":{"title":"초음파 감지기","links":["tags/초음파","tags/국제테크노기술연구소"],"tags":["초음파","국제테크노기술연구소"],"content":"#초음파#국제테크노기술연구소\n\n초음파식 가스미터의 원리와 계측 성능(자료제공) (ktechno.co.kr)\n초음파 가스 누출 감지기 - 정밀 안전 솔루션 - 음향 누출 (precisionsafety.com.au)\nObserver i 초음파 가스 누출 감지기 - 초음파 가스 누출 (precisionsafety.com.au)\nUltrasonic Leak Detectors: Finding Leaks With Ultrasound - Technical Articles (control.com)\nGDU-Incus (emerson.com)\n\n\n"},"가스센서/시장조사자료/(자료)가스센서-유망시장-이슈-리포트":{"title":"(자료)가스센서 유망시장 이슈 리포트","links":["tags/시장조사"],"tags":["시장조사"],"content":"#시장조사\n"},"가스센서/응용제품/Smart-Citizen":{"title":"Smart Citizen","links":["tags/응용제품"],"tags":["응용제품"],"content":"#응용제품\nSmart Citizen\nSmart Citizen Kit and Station: An open environmental monitoring system for citizen participation and scientific experimentation - HardwareX (hardware-x.com)\n1-s2.0-S2468067219300203-main.pdf]]\n"}}